espressif/esp-idf/components/soc/esp32p4/include/soc/iomux_struct.h
/** Type of gpio15 register
 *  iomux control register for gpio15
 */
typedef union {
    struct {
        /** gpio15_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio15_mcu_oe:1;
        /** gpio15_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio15_slp_sel:1;
        /** gpio15_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio15_mcu_wpd:1;
        /** gpio15_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio15_mcu_wpu:1;
        /** gpio15_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio15_mcu_ie:1;
        /** gpio15_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio15_mcu_drv:2;
        /** gpio15_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio15_fun_wpd:1;
        /** gpio15_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio15_fun_wpu:1;
        /** gpio15_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio15_fun_ie:1;
        /** gpio15_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio15_fun_drv:2;
        /** gpio15_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio15_mcu_sel:3;
        /** gpio15_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio15_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio15_reg_t;

/** Type of gpio16 register
 *  iomux control register for gpio16
 */
typedef union {
    struct {
        /** gpio16_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio16_mcu_oe:1;
        /** gpio16_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio16_slp_sel:1;
        /** gpio16_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio16_mcu_wpd:1;
        /** gpio16_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio16_mcu_wpu:1;
        /** gpio16_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio16_mcu_ie:1;
        /** gpio16_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio16_mcu_drv:2;
        /** gpio16_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio16_fun_wpd:1;
        /** gpio16_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio16_fun_wpu:1;
        /** gpio16_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio16_fun_ie:1;
        /** gpio16_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio16_fun_drv:2;
        /** gpio16_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio16_mcu_sel:3;
        /** gpio16_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio16_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio16_reg_t;

/** Type of gpio17 register
 *  iomux control register for gpio17
 */
typedef union {
    struct {
        /** gpio17_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio17_mcu_oe:1;
        /** gpio17_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio17_slp_sel:1;
        /** gpio17_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio17_mcu_wpd:1;
        /** gpio17_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio17_mcu_wpu:1;
        /** gpio17_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio17_mcu_ie:1;
        /** gpio17_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio17_mcu_drv:2;
        /** gpio17_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio17_fun_wpd:1;
        /** gpio17_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio17_fun_wpu:1;
        /** gpio17_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio17_fun_ie:1;
        /** gpio17_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio17_fun_drv:2;
        /** gpio17_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio17_mcu_sel:3;
        /** gpio17_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio17_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio17_reg_t;

/** Type of gpio18 register
 *  iomux control register for gpio18
 */
typedef union {
    struct {
        /** gpio18_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio18_mcu_oe:1;
        /** gpio18_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio18_slp_sel:1;
        /** gpio18_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio18_mcu_wpd:1;
        /** gpio18_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio18_mcu_wpu:1;
        /** gpio18_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio18_mcu_ie:1;
        /** gpio18_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio18_mcu_drv:2;
        /** gpio18_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio18_fun_wpd:1;
        /** gpio18_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio18_fun_wpu:1;
        /** gpio18_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio18_fun_ie:1;
        /** gpio18_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio18_fun_drv:2;
        /** gpio18_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio18_mcu_sel:3;
        /** gpio18_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio18_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio18_reg_t;

/** Type of gpio19 register
 *  iomux control register for gpio19
 */
typedef union {
    struct {
        /** gpio19_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio19_mcu_oe:1;
        /** gpio19_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio19_slp_sel:1;
        /** gpio19_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio19_mcu_wpd:1;
        /** gpio19_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio19_mcu_wpu:1;
        /** gpio19_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio19_mcu_ie:1;
        /** gpio19_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio19_mcu_drv:2;
        /** gpio19_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio19_fun_wpd:1;
        /** gpio19_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio19_fun_wpu:1;
        /** gpio19_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio19_fun_ie:1;
        /** gpio19_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio19_fun_drv:2;
        /** gpio19_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio19_mcu_sel:3;
        /** gpio19_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio19_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio19_reg_t;

/** Type of gpio20 register
 *  iomux control register for gpio20
 */
typedef union {
    struct {
        /** gpio20_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio20_mcu_oe:1;
        /** gpio20_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio20_slp_sel:1;
        /** gpio20_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio20_mcu_wpd:1;
        /** gpio20_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio20_mcu_wpu:1;
        /** gpio20_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio20_mcu_ie:1;
        /** gpio20_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio20_mcu_drv:2;
        /** gpio20_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio20_fun_wpd:1;
        /** gpio20_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio20_fun_wpu:1;
        /** gpio20_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio20_fun_ie:1;
        /** gpio20_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio20_fun_drv:2;
        /** gpio20_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio20_mcu_sel:3;
        /** gpio20_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio20_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio20_reg_t;

/** Type of gpio21 register
 *  iomux control register for gpio21
 */
typedef union {
    struct {
        /** gpio21_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio21_mcu_oe:1;
        /** gpio21_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio21_slp_sel:1;
        /** gpio21_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio21_mcu_wpd:1;
        /** gpio21_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio21_mcu_wpu:1;
        /** gpio21_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio21_mcu_ie:1;
        /** gpio21_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio21_mcu_drv:2;
        /** gpio21_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio21_fun_wpd:1;
        /** gpio21_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio21_fun_wpu:1;
        /** gpio21_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio21_fun_ie:1;
        /** gpio21_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio21_fun_drv:2;
        /** gpio21_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio21_mcu_sel:3;
        /** gpio21_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio21_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio21_reg_t;

