espressif/esp-idf/components/soc/esp32p4/include/soc/iomux_struct.h
/** Type of gpio22 register
 *  iomux control register for gpio22
 */
typedef union {
    struct {
        /** gpio22_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio22_mcu_oe:1;
        /** gpio22_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio22_slp_sel:1;
        /** gpio22_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio22_mcu_wpd:1;
        /** gpio22_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio22_mcu_wpu:1;
        /** gpio22_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio22_mcu_ie:1;
        /** gpio22_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio22_mcu_drv:2;
        /** gpio22_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio22_fun_wpd:1;
        /** gpio22_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio22_fun_wpu:1;
        /** gpio22_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio22_fun_ie:1;
        /** gpio22_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio22_fun_drv:2;
        /** gpio22_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio22_mcu_sel:3;
        /** gpio22_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio22_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio22_reg_t;

/** Type of gpio23 register
 *  iomux control register for gpio23
 */
typedef union {
    struct {
        /** gpio23_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio23_mcu_oe:1;
        /** gpio23_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio23_slp_sel:1;
        /** gpio23_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio23_mcu_wpd:1;
        /** gpio23_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio23_mcu_wpu:1;
        /** gpio23_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio23_mcu_ie:1;
        /** gpio23_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio23_mcu_drv:2;
        /** gpio23_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio23_fun_wpd:1;
        /** gpio23_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio23_fun_wpu:1;
        /** gpio23_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio23_fun_ie:1;
        /** gpio23_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio23_fun_drv:2;
        /** gpio23_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio23_mcu_sel:3;
        /** gpio23_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio23_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio23_reg_t;

/** Type of gpio24 register
 *  iomux control register for gpio24
 */
typedef union {
    struct {
        /** gpio24_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio24_mcu_oe:1;
        /** gpio24_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio24_slp_sel:1;
        /** gpio24_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio24_mcu_wpd:1;
        /** gpio24_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio24_mcu_wpu:1;
        /** gpio24_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio24_mcu_ie:1;
        /** gpio24_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio24_mcu_drv:2;
        /** gpio24_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio24_fun_wpd:1;
        /** gpio24_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio24_fun_wpu:1;
        /** gpio24_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio24_fun_ie:1;
        /** gpio24_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio24_fun_drv:2;
        /** gpio24_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio24_mcu_sel:3;
        /** gpio24_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio24_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio24_reg_t;

/** Type of gpio25 register
 *  iomux control register for gpio25
 */
typedef union {
    struct {
        /** gpio25_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio25_mcu_oe:1;
        /** gpio25_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio25_slp_sel:1;
        /** gpio25_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio25_mcu_wpd:1;
        /** gpio25_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio25_mcu_wpu:1;
        /** gpio25_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio25_mcu_ie:1;
        /** gpio25_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio25_mcu_drv:2;
        /** gpio25_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio25_fun_wpd:1;
        /** gpio25_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio25_fun_wpu:1;
        /** gpio25_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio25_fun_ie:1;
        /** gpio25_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio25_fun_drv:2;
        /** gpio25_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio25_mcu_sel:3;
        /** gpio25_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio25_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio25_reg_t;

/** Type of gpio26 register
 *  iomux control register for gpio26
 */
typedef union {
    struct {
        /** gpio26_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio26_mcu_oe:1;
        /** gpio26_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio26_slp_sel:1;
        /** gpio26_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio26_mcu_wpd:1;
        /** gpio26_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio26_mcu_wpu:1;
        /** gpio26_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio26_mcu_ie:1;
        /** gpio26_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio26_mcu_drv:2;
        /** gpio26_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio26_fun_wpd:1;
        /** gpio26_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio26_fun_wpu:1;
        /** gpio26_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio26_fun_ie:1;
        /** gpio26_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio26_fun_drv:2;
        /** gpio26_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio26_mcu_sel:3;
        /** gpio26_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio26_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio26_reg_t;

