espressif/esp-idf/components/soc/esp32p4/include/soc/iomux_struct.h
/** Type of gpio27 register
 *  iomux control register for gpio27
 */
typedef union {
    struct {
        /** gpio27_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio27_mcu_oe:1;
        /** gpio27_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio27_slp_sel:1;
        /** gpio27_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio27_mcu_wpd:1;
        /** gpio27_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio27_mcu_wpu:1;
        /** gpio27_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio27_mcu_ie:1;
        /** gpio27_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio27_mcu_drv:2;
        /** gpio27_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio27_fun_wpd:1;
        /** gpio27_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio27_fun_wpu:1;
        /** gpio27_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio27_fun_ie:1;
        /** gpio27_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio27_fun_drv:2;
        /** gpio27_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio27_mcu_sel:3;
        /** gpio27_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio27_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio27_reg_t;

/** Type of gpio28 register
 *  iomux control register for gpio28
 */
typedef union {
    struct {
        /** gpio28_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio28_mcu_oe:1;
        /** gpio28_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio28_slp_sel:1;
        /** gpio28_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio28_mcu_wpd:1;
        /** gpio28_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio28_mcu_wpu:1;
        /** gpio28_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio28_mcu_ie:1;
        /** gpio28_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio28_mcu_drv:2;
        /** gpio28_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio28_fun_wpd:1;
        /** gpio28_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio28_fun_wpu:1;
        /** gpio28_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio28_fun_ie:1;
        /** gpio28_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio28_fun_drv:2;
        /** gpio28_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio28_mcu_sel:3;
        /** gpio28_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio28_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio28_reg_t;

/** Type of gpio29 register
 *  iomux control register for gpio29
 */
typedef union {
    struct {
        /** gpio29_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio29_mcu_oe:1;
        /** gpio29_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio29_slp_sel:1;
        /** gpio29_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio29_mcu_wpd:1;
        /** gpio29_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio29_mcu_wpu:1;
        /** gpio29_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio29_mcu_ie:1;
        /** gpio29_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio29_mcu_drv:2;
        /** gpio29_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio29_fun_wpd:1;
        /** gpio29_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio29_fun_wpu:1;
        /** gpio29_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio29_fun_ie:1;
        /** gpio29_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio29_fun_drv:2;
        /** gpio29_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio29_mcu_sel:3;
        /** gpio29_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio29_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio29_reg_t;

/** Type of gpio30 register
 *  iomux control register for gpio30
 */
typedef union {
    struct {
        /** gpio30_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio30_mcu_oe:1;
        /** gpio30_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio30_slp_sel:1;
        /** gpio30_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio30_mcu_wpd:1;
        /** gpio30_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio30_mcu_wpu:1;
        /** gpio30_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio30_mcu_ie:1;
        /** gpio30_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio30_mcu_drv:2;
        /** gpio30_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio30_fun_wpd:1;
        /** gpio30_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio30_fun_wpu:1;
        /** gpio30_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio30_fun_ie:1;
        /** gpio30_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio30_fun_drv:2;
        /** gpio30_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio30_mcu_sel:3;
        /** gpio30_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio30_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio30_reg_t;

/** Type of gpio31 register
 *  iomux control register for gpio31
 */
typedef union {
    struct {
        /** gpio31_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio31_mcu_oe:1;
        /** gpio31_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio31_slp_sel:1;
        /** gpio31_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio31_mcu_wpd:1;
        /** gpio31_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio31_mcu_wpu:1;
        /** gpio31_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio31_mcu_ie:1;
        /** gpio31_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio31_mcu_drv:2;
        /** gpio31_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio31_fun_wpd:1;
        /** gpio31_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio31_fun_wpu:1;
        /** gpio31_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio31_fun_ie:1;
        /** gpio31_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio31_fun_drv:2;
        /** gpio31_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio31_mcu_sel:3;
        /** gpio31_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio31_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio31_reg_t;

