espressif/esp-idf/components/soc/esp32p4/include/soc/iomux_struct.h
/** Type of gpio32 register
 *  iomux control register for gpio32
 */
typedef union {
    struct {
        /** gpio32_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio32_mcu_oe:1;
        /** gpio32_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio32_slp_sel:1;
        /** gpio32_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio32_mcu_wpd:1;
        /** gpio32_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio32_mcu_wpu:1;
        /** gpio32_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio32_mcu_ie:1;
        /** gpio32_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio32_mcu_drv:2;
        /** gpio32_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio32_fun_wpd:1;
        /** gpio32_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio32_fun_wpu:1;
        /** gpio32_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio32_fun_ie:1;
        /** gpio32_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio32_fun_drv:2;
        /** gpio32_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio32_mcu_sel:3;
        /** gpio32_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio32_filter_en:1;
        /** gpio32_rue_i3c : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t gpio32_rue_i3c:1;
        /** gpio32_ru_i3c : R/W; bitpos: [18:17]; default: 0;
         *  NA
         */
        uint32_t gpio32_ru_i3c:2;
        /** gpio32_rue_sel_i3c : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t gpio32_rue_sel_i3c:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} io_mux_gpio32_reg_t;

/** Type of gpio33 register
 *  iomux control register for gpio33
 */
typedef union {
    struct {
        /** gpio33_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio33_mcu_oe:1;
        /** gpio33_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio33_slp_sel:1;
        /** gpio33_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio33_mcu_wpd:1;
        /** gpio33_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio33_mcu_wpu:1;
        /** gpio33_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio33_mcu_ie:1;
        /** gpio33_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio33_mcu_drv:2;
        /** gpio33_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio33_fun_wpd:1;
        /** gpio33_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio33_fun_wpu:1;
        /** gpio33_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio33_fun_ie:1;
        /** gpio33_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio33_fun_drv:2;
        /** gpio33_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio33_mcu_sel:3;
        /** gpio33_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio33_filter_en:1;
        /** gpio33_rue_i3c : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t gpio33_rue_i3c:1;
        /** gpio33_ru_i3c : R/W; bitpos: [18:17]; default: 0;
         *  NA
         */
        uint32_t gpio33_ru_i3c:2;
        /** gpio33_rue_sel_i3c : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t gpio33_rue_sel_i3c:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} io_mux_gpio33_reg_t;

/** Type of gpio34 register
 *  iomux control register for gpio34
 */
typedef union {
    struct {
        /** gpio34_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio34_mcu_oe:1;
        /** gpio34_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio34_slp_sel:1;
        /** gpio34_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio34_mcu_wpd:1;
        /** gpio34_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio34_mcu_wpu:1;
        /** gpio34_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio34_mcu_ie:1;
        /** gpio34_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio34_mcu_drv:2;
        /** gpio34_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio34_fun_wpd:1;
        /** gpio34_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio34_fun_wpu:1;
        /** gpio34_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio34_fun_ie:1;
        /** gpio34_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio34_fun_drv:2;
        /** gpio34_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio34_mcu_sel:3;
        /** gpio34_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio34_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio34_reg_t;

/** Type of gpio35 register
 *  iomux control register for gpio35
 */
typedef union {
    struct {
        /** gpio35_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio35_mcu_oe:1;
        /** gpio35_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio35_slp_sel:1;
        /** gpio35_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio35_mcu_wpd:1;
        /** gpio35_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio35_mcu_wpu:1;
        /** gpio35_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio35_mcu_ie:1;
        /** gpio35_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio35_mcu_drv:2;
        /** gpio35_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio35_fun_wpd:1;
        /** gpio35_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio35_fun_wpu:1;
        /** gpio35_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio35_fun_ie:1;
        /** gpio35_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio35_fun_drv:2;
        /** gpio35_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio35_mcu_sel:3;
        /** gpio35_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio35_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio35_reg_t;

/** Type of gpio36 register
 *  iomux control register for gpio36
 */
typedef union {
    struct {
        /** gpio36_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio36_mcu_oe:1;
        /** gpio36_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio36_slp_sel:1;
        /** gpio36_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio36_mcu_wpd:1;
        /** gpio36_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio36_mcu_wpu:1;
        /** gpio36_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio36_mcu_ie:1;
        /** gpio36_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio36_mcu_drv:2;
        /** gpio36_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio36_fun_wpd:1;
        /** gpio36_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio36_fun_wpu:1;
        /** gpio36_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio36_fun_ie:1;
        /** gpio36_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio36_fun_drv:2;
        /** gpio36_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio36_mcu_sel:3;
        /** gpio36_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio36_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio36_reg_t;

