espressif/esp-idf/components/soc/esp32p4/include/soc/iomux_struct.h
/** Type of gpio41 register
 *  iomux control register for gpio41
 */
typedef union {
    struct {
        /** gpio41_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio41_mcu_oe:1;
        /** gpio41_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio41_slp_sel:1;
        /** gpio41_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio41_mcu_wpd:1;
        /** gpio41_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio41_mcu_wpu:1;
        /** gpio41_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio41_mcu_ie:1;
        /** gpio41_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio41_mcu_drv:2;
        /** gpio41_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio41_fun_wpd:1;
        /** gpio41_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio41_fun_wpu:1;
        /** gpio41_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio41_fun_ie:1;
        /** gpio41_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio41_fun_drv:2;
        /** gpio41_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio41_mcu_sel:3;
        /** gpio41_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio41_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio41_reg_t;

/** Type of gpio42 register
 *  iomux control register for gpio42
 */
typedef union {
    struct {
        /** gpio42_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio42_mcu_oe:1;
        /** gpio42_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio42_slp_sel:1;
        /** gpio42_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio42_mcu_wpd:1;
        /** gpio42_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio42_mcu_wpu:1;
        /** gpio42_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio42_mcu_ie:1;
        /** gpio42_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio42_mcu_drv:2;
        /** gpio42_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio42_fun_wpd:1;
        /** gpio42_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio42_fun_wpu:1;
        /** gpio42_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio42_fun_ie:1;
        /** gpio42_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio42_fun_drv:2;
        /** gpio42_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio42_mcu_sel:3;
        /** gpio42_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio42_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio42_reg_t;

/** Type of gpio43 register
 *  iomux control register for gpio43
 */
typedef union {
    struct {
        /** gpio43_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio43_mcu_oe:1;
        /** gpio43_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio43_slp_sel:1;
        /** gpio43_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio43_mcu_wpd:1;
        /** gpio43_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio43_mcu_wpu:1;
        /** gpio43_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio43_mcu_ie:1;
        /** gpio43_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio43_mcu_drv:2;
        /** gpio43_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio43_fun_wpd:1;
        /** gpio43_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio43_fun_wpu:1;
        /** gpio43_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio43_fun_ie:1;
        /** gpio43_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio43_fun_drv:2;
        /** gpio43_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio43_mcu_sel:3;
        /** gpio43_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio43_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio43_reg_t;

/** Type of gpio44 register
 *  iomux control register for gpio44
 */
typedef union {
    struct {
        /** gpio44_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio44_mcu_oe:1;
        /** gpio44_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio44_slp_sel:1;
        /** gpio44_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio44_mcu_wpd:1;
        /** gpio44_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio44_mcu_wpu:1;
        /** gpio44_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio44_mcu_ie:1;
        /** gpio44_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio44_mcu_drv:2;
        /** gpio44_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio44_fun_wpd:1;
        /** gpio44_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio44_fun_wpu:1;
        /** gpio44_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio44_fun_ie:1;
        /** gpio44_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio44_fun_drv:2;
        /** gpio44_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio44_mcu_sel:3;
        /** gpio44_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio44_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio44_reg_t;

/** Type of gpio45 register
 *  iomux control register for gpio45
 */
typedef union {
    struct {
        /** gpio45_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio45_mcu_oe:1;
        /** gpio45_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio45_slp_sel:1;
        /** gpio45_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio45_mcu_wpd:1;
        /** gpio45_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio45_mcu_wpu:1;
        /** gpio45_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio45_mcu_ie:1;
        /** gpio45_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio45_mcu_drv:2;
        /** gpio45_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio45_fun_wpd:1;
        /** gpio45_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio45_fun_wpu:1;
        /** gpio45_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio45_fun_ie:1;
        /** gpio45_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio45_fun_drv:2;
        /** gpio45_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio45_mcu_sel:3;
        /** gpio45_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio45_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio45_reg_t;

/** Type of gpio46 register
 *  iomux control register for gpio46
 */
typedef union {
    struct {
        /** gpio46_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio46_mcu_oe:1;
        /** gpio46_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio46_slp_sel:1;
        /** gpio46_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio46_mcu_wpd:1;
        /** gpio46_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio46_mcu_wpu:1;
        /** gpio46_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio46_mcu_ie:1;
        /** gpio46_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio46_mcu_drv:2;
        /** gpio46_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio46_fun_wpd:1;
        /** gpio46_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio46_fun_wpu:1;
        /** gpio46_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio46_fun_ie:1;
        /** gpio46_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio46_fun_drv:2;
        /** gpio46_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio46_mcu_sel:3;
        /** gpio46_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio46_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio46_reg_t;

/** Type of gpio47 register
 *  iomux control register for gpio47
 */
typedef union {
    struct {
        /** gpio47_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio47_mcu_oe:1;
        /** gpio47_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio47_slp_sel:1;
        /** gpio47_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio47_mcu_wpd:1;
        /** gpio47_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio47_mcu_wpu:1;
        /** gpio47_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio47_mcu_ie:1;
        /** gpio47_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio47_mcu_drv:2;
        /** gpio47_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio47_fun_wpd:1;
        /** gpio47_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio47_fun_wpu:1;
        /** gpio47_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio47_fun_ie:1;
        /** gpio47_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio47_fun_drv:2;
        /** gpio47_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio47_mcu_sel:3;
        /** gpio47_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio47_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio47_reg_t;

/** Type of gpio48 register
 *  iomux control register for gpio48
 */
typedef union {
    struct {
        /** gpio48_mcu_oe : R/W; bitpos: [0]; default: 0;
         *  output enable on sleep mode
         */
        uint32_t gpio48_mcu_oe:1;
        /** gpio48_slp_sel : R/W; bitpos: [1]; default: 0;
         *  io sleep mode enable. set 1 to enable sleep mode.
         */
        uint32_t gpio48_slp_sel:1;
        /** gpio48_mcu_wpd : R/W; bitpos: [2]; default: 0;
         *  pull-down enable on sleep mode
         */
        uint32_t gpio48_mcu_wpd:1;
        /** gpio48_mcu_wpu : R/W; bitpos: [3]; default: 0;
         *  pull-up enable on sleep mode
         */
        uint32_t gpio48_mcu_wpu:1;
        /** gpio48_mcu_ie : R/W; bitpos: [4]; default: 0;
         *  input enable on sleep mode
         */
        uint32_t gpio48_mcu_ie:1;
        /** gpio48_mcu_drv : R/W; bitpos: [6:5]; default: 0;
         *  select drive strenth on sleep mode
         */
        uint32_t gpio48_mcu_drv:2;
        /** gpio48_fun_wpd : R/W; bitpos: [7]; default: 0;
         *  pull-down enable
         */
        uint32_t gpio48_fun_wpd:1;
        /** gpio48_fun_wpu : R/W; bitpos: [8]; default: 0;
         *  pull-up enable
         */
        uint32_t gpio48_fun_wpu:1;
        /** gpio48_fun_ie : R/W; bitpos: [9]; default: 0;
         *  input enable
         */
        uint32_t gpio48_fun_ie:1;
        /** gpio48_fun_drv : R/W; bitpos: [11:10]; default: 2;
         *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
         */
        uint32_t gpio48_fun_drv:2;
        /** gpio48_mcu_sel : R/W; bitpos: [14:12]; default: 0;
         *  0:select function0, 1:select function1 ...
         */
        uint32_t gpio48_mcu_sel:3;
        /** gpio48_filter_en : R/W; bitpos: [15]; default: 0;
         *  input filter enable
         */
        uint32_t gpio48_filter_en:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} io_mux_gpio48_reg_t;

